In [25]:
import pandas as pd
import numpy as np

dict = {
    'Name':['Umang', 'Vanish', 'Tanish', 'Tejsav'],
    'Marks':[90, 45, 89,67],  
    'City':['Patan', 'Mumbai', 'Delhi', 'Ahmedabad']
}

df = pd.DataFrame(dict)

print(df)

     Name  Marks       City
0   Umang     90      Patan
1  Vanish     45     Mumbai
2  Tanish     89      Delhi
3  Tejsav     67  Ahmedabad

In [26]:
df.to_csv('Data.csv')

In [27]:
df.head(2)

     Name  Marks    City
0   Umang     90   Patan
1  Vanish     45  Mumbai

In [28]:
df

     Name  Marks       City
0   Umang     90      Patan
1  Vanish     45     Mumbai
2  Tanish     89      Delhi
3  Tejsav     67  Ahmedabad

In [29]:
df.tail(2)

     Name  Marks       City
2  Tanish     89      Delhi
3  Tejsav     67  Ahmedabad